Revit 2027 API
OverrideGraphicSettings.SetProjectionLinePatternId Method
 Sets the ElementId of the projection surface line pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public OverrideGraphicSettings SetProjectionLinePatternId(
	ElementId linePatternId
)
Public Function SetProjectionLinePatternId (
	linePatternId As ElementId
) As OverrideGraphicSettings
public:
OverrideGraphicSettings^ SetProjectionLinePatternId(
	ElementId^ linePatternId
)
member SetProjectionLinePatternId :
        linePatternId : ElementId -> OverrideGraphicSettings
Parameters
linePatternId ElementId
 ElementId of the projection surface line pattern for the override. InvalidElementId means no override is set.
Return Value
OverrideGraphicSettings
 Reference to the changed object.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace